Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In such cases HTTP `401` will be returned by default. However, you can instead request that a custom public error endpoint is called in order to return a user-friendly HTML error page. Use `quarkus.oidc.authentication.error-path`, for example:
ja_jp: このような場合、デフォルトでは HTTP `401` が返されます。しかし、ユーザーにわかりやすいエラーメッセージを返すために、カスタムのパブリックエラーエンドポイントを呼び出すように要求することができます。例えば、 `quarkus.oidc.authentication.error-path` を使用します。

source: In such cases configuring Quarkus to recognize the original headers forwarded by the proxy will be required, for more information, see the xref:http-reference.adoc#reverse-proxy[Running behind a reverse proxy] Vert.x documentation section.
ja_jp: このような場合、プロキシによって転送された元のヘッダーを認識するようにQuarkusを設定する必要があります。詳細については、 xref:http-reference.adoc#reverse-proxy[リバースプロキシの背後で実行] Vert.xのドキュメントセクションをご覧ください。

source: In such cases configuring Quarkus to recognize the original headers forwarded by the proxy will be required, see xref:http-reference.adoc#reverse-proxy[Running behind a reverse proxy] Vert.x documentation section for more information.
ja_jp: このような場合、プロキシーによって転送された元のヘッダーを認識するようにQuarkusを設定する必要があります。詳細については、xref:http-reference.adoc#reverse-proxy[リバースプロキシーの背後での実行] Vert.xのドキュメントセクションを参照してください。

source: In such cases the mechanisms are asked to verify the credentials in turn until a `SecurityIdentity` is created. The mechanisms are sorted in the descending order using their priority. `Basic` authentication mechanism has the highest priority of `2000`, followed by the `Authorization Code` one with the priority of `1001`, with all other mechanisms provided by Quarkus having the priority of `1000`.
ja_jp: このような場合、 `SecurityIdentity` が作成されるまで、メカニズムが順番にクレデンシャルを検証するように要求されます。認証メカニズムは、優先度の降順でソートされています。 `Basic` 認証メカニズムの優先順位は最高で `2000` 、次いで `Authorization Code` の優先順位は `1001` 、Quarkus が提供する他のすべてのメカニズムの優先順位は `1000` となっています。

source: In such cases you may want to consider skipping the issuer verification by setting `quarkus.oidc.token.issuer=any`. Please note that it is not recommended and should be avoided unless no other options are available:
ja_jp: このような場合には、 `quarkus.oidc.token.issuer=any` を設定して、issuer検証を省略することを検討してください。なお、この設定は推奨されておらず、他に選択肢がない場合を除き、避けるべきです。

source: In such cases, a `quarkus.oidc.authentication.redirect-path` property has to be set. For example, `quarkus.oidc.authentication.redirect-path=/service/callback`, and Quarkus will set the `redirect_uri` parameter to an absolute URL such as `http://localhost:8080/service/callback`, which will be the same regardless of the current request URL.
ja_jp: このような場合は、 `quarkus.oidc.authentication.redirect-path` プロパティーを設定する必要があります。 たとえば、 `quarkus.oidc.authentication.redirect-path=/service/callback` の場合、Quarkus は `redirect_uri` パラメーターを `http://localhost:8080/service/callback` などの絶対 URL に設定します。これは、現在のリクエスト URL に関係なく同じになります。

source: In such cases, an HTTP `401` error is returned by default. However, you can request that a custom public error endpoint be called to return a more user-friendly HTML error page. To do this, set the `quarkus.oidc.authentication.error-path` property, as shown in the following example:
ja_jp: このような場合、デフォルトで HTTP `401` エラーが返されます。 ただし、ユーザーにわかりやすいエラーメッセージを返すために、カスタムパブリックエラーエンドポイントを呼び出すようにリクエストできます。 これを行うには、 `quarkus.oidc.authentication.error-path` プロパティーを以下のように設定します。

source: In such cases, configuring Quarkus to recognize the original headers forwarded by the proxy will be required. For more information, see the xref:http-reference.adoc#reverse-proxy[Running behind a reverse proxy] Vert.x documentation section.
ja_jp: このような場合、プロキシーによって転送された元のヘッダーを認識するように Quarkus を設定する必要があります。 詳細は、xref:http-reference.adoc#reverse-proxy[リバースプロキシーの背後での実行] Vert.x のドキュメントセクションを参照してください。

source: In such cases, consider skipping the issuer verification by setting `quarkus.oidc.token.issuer=any`. Only skip the issuer verification if no other options are available:
ja_jp: このような場合は、 `quarkus.oidc.token.issuer=any` を設定して発行者の検証をスキップすることを検討してください。 発行者の検証のスキップは、他の方法を利用できない場合にのみ行ってください。

source: In such cases, if connections are slow—for instance, taking more than 3 seconds to respond to the key endpoint—the current event loop thread is likely to become blocked.
ja_jp: このような場合、接続が遅い場合 (たとえば、キーエンドポイントへの応答に 3 秒以上かかる場合)、現在のイベントループスレッドがブロックされる可能性があります。

source: In such cases, if you work with Keycloak then please start it with a `KEYCLOAK_FRONTEND_URL` system property set to the externally accessible base URL. If you work with other Openid Connect providers then please check your provider's documentation.
ja_jp: このような場合、Keycloak を使用する場合は、外部からアクセス可能なベース URL に設定された `KEYCLOAK_FRONTEND_URL` システムプロパティーで起動してください。他の Openid Connect プロバイダーと連携している場合は、プロバイダーのドキュメントを確認してください。

source: In such cases, if you work with Keycloak, start it with the `KEYCLOAK_FRONTEND_URL` system property set to the externally accessible base URL. If you work with other OIDC providers, refer to your provider's documentation.
ja_jp: このような場合に Keycloak を使用する場合は、 `KEYCLOAK_FRONTEND_URL` システムプロパティーを外部からアクセス可能なベース URL に設定して Keycloak を起動してください。 他の OIDC プロバイダーを使用する場合は、プロバイダーのドキュメントを参照してください。

source: In such cases, set the `quarkus.oidc.authentication.java-script-auto-redirect` property to `false` which will instruct Quarkus to return a `499` status code and `WWW-Authenticate` header with the `OIDC` value. The browser script also needs to be updated to set `X-Requested-With` header with the `JavaScript` value and reload the last requested page in case of `499`, for example:
ja_jp: この場合、 `Quarkus.oidc.authentication.java-script-auto-redirect` プロパティーを `false` に設定すると、ステータスコード `499` と `OIDC` 値を持つ `WWW-Authenticate` ヘッダーを返すように Quarkus に指示が出されます。ブラウザースクリプトも更新して、 `X-Requested-With` ヘッダーに `JavaScript` 値を設定し、 `499` の場合は最後にリクエストしたページを再読み込みするなどの処理が必要になります。

source: In such cases, set the `quarkus.oidc.authentication.java-script-auto-redirect` property to `false`, which will instruct Quarkus to return a `499` status code and a `WWW-Authenticate` header with the `OIDC` value.
ja_jp: このような場合は、 `quarkus.oidc.authentication.java-script-auto-redirect` プロパティーを `false` に設定します。これにより、Quarkus は `499` ステータスコードと `OIDC` 値を含む `WWW-Authenticate` ヘッダーを返すように指示されます。

source: In such cases, use the `quarkus.oidc.token-state-manager.strategy` property to configure the token state strategy as follows:
ja_jp: このような場合は、 `quarkus.oidc.token-state-manager.strategy` プロパティーを使用して、トークン状態ストラテジーを次のように設定します。

source: In such cases, use the following configuration instead:
ja_jp: そのような場合は、代わりに以下のような設定にしてください。

source: In such situations the link:https://flywaydb.org/documentation/command/repair[Flyway repair command] comes in handy. In Quarkus this can either be executed automatically before the migration by setting `quarkus.flyway.repair-at-start=true` or manually by injecting the `Flyway` object and calling `Flyway#repair()`.
ja_jp: このような状況では、 link:https://flywaydb.org/documentation/command/repair[Flyway repairコマンド] が便利です。Quarkusでは、マイグレーション前に `quarkus.flyway.repair-at-start=true` を設定して自動的に実行するか、 `Flyway` オブジェクトをインジェクションして `Flyway#repair()` を呼び出すことで手動で実行することができます。

source: In summary, Quarkus is not only a robust and efficient framework but also a future-proof solution for building diverse, scalable, and resilient applications in today’s fast-paced digital world. With its reactive core, adaptable development models, and broad protocol support, Quarkus provides the tools necessary to meet modern application development's diverse and growing demands.
ja_jp: つまり、Quarkus は堅牢で効率的なフレームワークであるだけでなく、今日の急速に変化するデジタル世界において、多様でスケーラブルで回復力のあるアプリケーションを構築するための将来を見据えたソリューションでもあります。リアクティブ コア、適応性の高い開発モデル、幅広いプロトコル サポートを備えた Quarkus は、現代のアプリケーション開発の多様で増大する需要を満たすために必要なツールを提供します。

source: In terms of CDI, `@RequestScoped`, `@ApplicationScoped` and `@Singleton` beans get propagated and are available in other threads. `@Dependent` beans as well as any custom scoped beans cannot be automatically propagated via CDI Context Propagation.
ja_jp: CDI の観点からは、 `@RequestScoped`, `@ApplicationScoped`, `@Singleton` Beanは伝播され、他のスレッドで利用可能です。 `@Dependent` BeanやカスタムスコープされたBeanは、CDI コンテキスト伝播を介して自動的に伝播されることはありません。

source: In terms of RSS, Project Leyden does not significantly change the picture, while native executables offer a substantially lower memory footprint.
ja_jp: RSS の観点では、Project Leyden は状況を大きく変えませんが、ネイティブ実行可能ファイルは大幅に低いメモリフットプリントを提供します。

source: In that case, also use a custom `TenantConfigResolver` to resolve it:
ja_jp: その場合は、カスタム `TenantConfigResolver` も使用して解決します。

source: In that case, it is possible to add as many executions as needed to the Quarkus Maven plugin configuration.
ja_jp: この場合、Quarkus Maven プラグイン設定に必要な数の実行を追加することができます。

source: In that case, keep in mind that the JDBC driver or Hibernate ORM dialect may not work properly in GraalVM native executables.
ja_jp: この場合、JDBCドライバやHibernate ORM dialectがGraalVMネイティブ実行可能ファイルでは 正しく動作しない可能性があることに留意してください。

source: In that case, you will need to stop and remove these containers manually.
ja_jp: その場合、これらのコンテナを手動で停止して削除する必要があります。

source: In that situation, you can annotate your build step with `@Produce(ServiceStartBuildItem.class)` to make your build step produce an automatically generated `ServiceStartBuildItem` which is consumed by an internal Quarkus build step thus ensuring that your build step is always "consumed" and therefore is included in the build process. Another option could also be to annotation your build step with `@Produce(ArtifactResultBuildItem.class)`, however, this item is not consumed by Quarkus in Dev mode so your build step won't take effect in that case.
ja_jp: そのような状況では、あなたのビルドステップに `@Produce(ServiceStartBuildItem.class)` アノテーションを付与することで、自動生成される `ServiceStartBuildItem` を生成させることができます。これは内部の Quarkus ビルドステップによって消費されるため、あなたのビルドステップが常に「消費され」、ビルドプロセスに含まれることが保証されます。別の選択肢として、ビルドステップに `@Produce(ArtifactResultBuildItem.class)` アノテーションを付与することもできますが、このアイテムは Quarkus の開発モードでは消費されないため、この場合、あなたのビルドステップは有効になりません。

source: In that vein, we hope that this short blog post will provide you with some insight on what makes RESTEasy Reactive special and clear up any misconceptions you may have had about it.
ja_jp: この短いブログ記事が、RESTEasy Reactive が特別である理由と、RESTEasy Reactive について抱いていた誤解を解き明かすためのヒントになればと思います。

source: In the */webapp* folder execute :
ja_jp: */webapp* フォルダ内で実行します。

source: In the <<mutual-tls>> section we configured the mutual TLS client authentication in the `application.properties` file like this:
ja_jp: <<mutual-tls>> セクションでは、次のように `application.properties` ファイルで相互 TLS クライアント認証を設定しました。

source: In the <<use-cert-attrs-to-augment-identity>> section we have mentioned that the `SecurityIdentityAugmentor` can be used to map the client certificate attribute values to the `SecurityIdentity` roles. The `MTLS` API allows you to define such roles mapping as well.
ja_jp: <<use-cert-attrs-to-augment-identity>> セクションで、`SecurityIdentityAugmentor` を使用してクライアント証明書属性値を `SecurityIdentity` ロールにマッピングできることを述べました。`MTLS` API を使用すると、そのようなロールマッピングも定義できます。

source: In the Dev UI console, you can also see output similar to the following:
ja_jp: Dev UI コンソールでは、次のような出力も表示されます。

source: In the JAX-RS specification there’s no way to handle exceptions differently for a specific JAX-RS Resource Class - all exception mapping is done in a global manner.
ja_jp: JAX-RS仕様では、特定のJAX-RSリソースクラスに対して異なる例外を処理する方法はありません - すべての例外のマッピングはグローバルな方法で行われます。

source: In the JVM mode a reflection-based value resolver may be used to access properties and call methods of the model classes. But this does not work for xref:building-native-image.adoc[a native executable] out of the box. As a result, you may encounter template exceptions like `Property "name" not found on the base object "org.acme.Foo" in expression {foo.name} in template hello.html` even if the `Foo` class declares a relevant getter method.
ja_jp: JVM モードでは、リフレクションベースの値リゾルバーが、プロパティーにアクセスし、モデルクラスのメソッドを呼び出すために使われる場合があります。 しかし、これは xref:building-native-image.adoc[ネイティブ実行可能ファイル] に対しては、そのままでは正しく機能しません。 その結果、`Foo` クラスが関連するゲッターメソッドを宣言していたとしても、`Property "name" not found on the base object "org.acme.Foo" in expression {foo.name} in template hello.html` などのテンプレート例外に遭遇する可能性があります。

source: In the JVM mode, there is no real difference, except that `StartupEvent` is always fired *after* `@Initialized(ApplicationScoped.class)` and `ShutdownEvent` is fired *before* `@Destroyed(ApplicationScoped.class)`. For a native executable build, however, `@Initialized(ApplicationScoped.class)` is fired as *part of the native build process*, whereas `StartupEvent` is fired when the native image is executed. See xref:writing-extensions.adoc#bootstrap-three-phases[Three Phases of Bootstrap and Quarkus Philosophy] for more details.
ja_jp: JVMモードでは、 `StartupEvent` が常に `@Initialized(ApplicationScoped.class)` の *後に* 起動され、 `ShutdownEvent` が `@Destroyed(ApplicationScoped.class)` の *前に* 起動されることを除けば、実質的な違いはありません。しかし、ネイティブの実行形式のビルドでは、 `@Initialized(ApplicationScoped.class)` は *ネイティブのビルドプロセスの一部* として起動され、 `StartupEvent` はネイティブイメージが実行されるときに起動されます。詳細は、link:writing-extensions.html#bootstrap-three-phases[Bootstrapの3つのフェーズとQuarkus Philosophy] を参照してください。

source: In the Java package folder /src/main/java/io/quarkus where the sample *GreetingResource.java* resides, create a new bean class called *Particle.java* with the following content:
ja_jp: サンプルの *GreetingResource.java* が存在するJavaパッケージフォルダ/src/main/java/io/quarkusに、 *Particle.java* という名前の新しいBeanクラスを以下の内容で作成します。

source: In the Java world, Ahead-of-Time (AOT) compilation rose to prominence with the introduction of GraalVM native image, which compiles Java applications into native executables.
ja_jp: Java の世界では、Java アプリケーションをネイティブ実行可能ファイルにコンパイルする GraalVM ネイティブイメージの登場により、Ahead-of-Time (AOT) コンパイルが注目を集めるようになりました。

source: In the JavaScript code, we need a function to refresh the list of fruits when:
ja_jp: JavaScript コードでは、次の場合に fruits のリストを更新する関数が必要です。

source: In the Javascript code, we need a function to refresh the list of fruits when:
ja_jp: Javascript コードでは、次の場合に fruits のリストを更新する関数が必要です。

source: In the Kotlin version, we've simply moved the bulk of the link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[`active record pattern`] functionality to the `companion object`. Apart from this slight change, we can then work with our types in ways that map easily from the Java side of world.
ja_jp: Kotlin版では、単純に link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[`active record pattern`] の機能を `companion object` に追加しました。このわずかな変更を別にすれば、私たちは、世界のJava側から簡単にマップする方法で私たちの型を使用して作業することができます。

source: In the Quarkus Security framework, identity providers play a crucial role in authentication and authorization by verifying user identities. `IdentityProvider` creates a `SecurityIdentity` instance, which gets used during user authentication to verify and authorize access requests to your Quarkus application.
ja_jp: Quarkus Securityフレームワークでは、IDプロバイダーは、ユーザーIDを検証することで、認証と認可において重要な役割を果たします。 `IdentityProvider` は、 `SecurityIdentity` インスタンスを作成します。 `SecurityIdentity` インスタンスはユーザー認証時に使用され、Quarkusアプリケーションへのアクセス要求を検証し、認可します。

source: In the Quarkus Security framework, identity providers play a crucial role in authentication and authorization by verifying user identities.
ja_jp: Quarkus Securityフレームワークでは、IDプロバイダーがユーザーIDを検証することで、認証と認可において重要な役割を果たします。

source: In the Quarkus core repository, the extension codestarts are all in the same https://github.com/quarkusio/quarkus/tree/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[module, window="_blank"].
ja_jp: Quarkus のコアレポジトリでは、エクステンションの Codestart はすべて同じ https://github.com/quarkusio/quarkus/tree/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[モジュール, window="_blank"] に入っています。

source: In the Quarkus ecosystem, this is common in low-level libraries such as Netty or Vert.x. But in reality, we see this pattern everywhere.
ja_jp: Quarkus エコシステムでは、Netty や Vert.x などの低レベルライブラリーでこれが一般的です。しかし実際には、このパターンはいたるところで見られます。

source: In the Webcomponent (Javascript):
ja_jp: Webcomponent (Javascript) の場合:

source: In the _initialization_ phase the preparatory work is being carried out and custom contexts are registered. _Bean discovery_ is then the process where the container analyzes all application classes, identifies beans and wires them all together based on the provided metadata. Subsequently, the extensions can register _synthetic components_. Attributes of these components are fully controlled by the extensions, i.e. are not derived from an existing class. Finally, the _deployment is validated_. For example, the container validates every injection point in the application and fails the build if there is no bean that satisfies the given required type and qualifiers.
ja_jp: _初期化_ フェーズでは、準備作業が行われ、カスタムコンテキストが登録されます。その後、コンテナーがすべてのアプリケーションクラスを分析し、Beanを識別し、提供されたメタデータに基づいてそれらをすべて繋ぎ合わせるプロセスがBean _ディスカバリ_ です。その後、エクステンションは _合成コンポーネント_ を登録することができます。これらのコンポーネントの属性はエクステンションによって完全に制御されます。最後に、 _デプロイメントが検証されます_ 。例えば、コンテナーはアプリケーション内のすべての注入ポイントを検証し、与えられた必要な型と修飾子を満たすBeanがない場合はビルドを失敗させます。

source: In the _initialization_ phase, the preparatory work is being carried out, and custom contexts are registered. _Bean discovery_ is then the process where the container analyzes all application classes, identifies beans and wires them all together based on the provided metadata. Subsequently, the extensions can register _synthetic components_. Attributes of these components are fully controlled by the extensions, i.e. are not derived from an existing class. Finally, the _deployment is validated_. For example, the container validates every injection point in the application and fails the build if there is no bean that satisfies the given required type and qualifiers.
ja_jp: _初期化_ フェーズでは、準備作業が実行され、カスタムコンテキストが登録されます。次に _Bean ディスカバリ_ は、コンテナーがすべてのアプリケーションクラスを分析し、Bean を識別し、提供されたメタデータに基づいてそれらすべてを結合するプロセスです。その後、エクステンションは _合成コンポーネント_ を登録できます。これらのコンポーネントの属性はエクステンションによって完全に制御されます。つまり、既存のクラスから派生したものではありません。最後に、_デプロイメントが検証されます_。たとえば、コンテナーはアプリケーション内のすべての注入ポイントを検証し、指定された必要な型と修飾子を満たす Bean がない場合、ビルドを失敗させます。

source: In the `application.properties` file, set the `quarkus.http.auth.basic` property to `true`.
ja_jp: `application.properties` ファイルで、`quarkus.http.auth.basic` プロパティーを `true` に設定します。

source: In the `org.acme.quartz` package, create the `TaskBean` class, with the following content:
ja_jp: `org.acme.quartz` パッケージで、以下の内容の `TaskBean` クラスを作成します:

source: In the `org.acme.quartz` package, create the `Task` class, with the following content:
ja_jp: `org.acme.quartz` パッケージで、以下の内容の `Task` クラスを作成します:

source: In the `org.acme.scheduler` package, create the `CounterBean` class, with the following content:
ja_jp: `org.acme.scheduler` パッケージ に、以下の内容の `CounterBean` クラスを作成します:

source: In the `org.acme.spring.scheduler` package, create the `CounterBean` class, with the following content:
ja_jp: `org.acme.spring.scheduler` パッケージで、以下の内容で `CounterBean` クラスを作成します:

source: In the `pom.xml,` we added an `argLine` argument to the surefire and failsafe plugins:
ja_jp: `pom.xml` では、surefire と failafe プラグインに `argLine` 引数を追加しました：

source: In the `pom.xml` file you should see 2 test dependencies:
ja_jp: `pom.xml` ファイルには、2つのテスト依存関係があるはずです:

source: In the `pom.xml` file, the `native` profile contains:
ja_jp: `pom.xml` ファイルには、 `native` プロファイルが含まれています。

source: In the `pom.xml`, you can add the following plugin configuration for JaCoCo. This will append integration test data into the same destination file as unit tests, re-build the JaCoCo report after the integration tests are complete, and thus produce a comprehensive code-coverage report.
ja_jp: `pom.xml` で、Jacocoのプラグイン設定を以下のように追加します。これにより、結合テストのデータをユニットテストと同じ保存先のファイルに追加し、結合テストが完了した後にjacocoレポートを再構築することで、包括的なコードカバレッジレポートを作成します。

source: In the `pom.xml`, you can add the following plugin configuration for Jacoco. This will append integration test data into the same destination file as unit tests, re-build the Jacoco report after the integration tests are complete, and thus produce a comprehensive code-coverage report.
ja_jp: `pom.xml` では、Jacocoのために以下のプラグイン構成を追加することができます。これは統合テストのデータを単体テストと同じ宛先ファイルに追加し、統合テストが完了した後にJacocoレポートを再ビルドし、包括的なコードカバレッジレポートを作成します。

source: In the `principal-query` configuration all the `index` properties start at 1 (rather than 0).
ja_jp: `principal-query` の設定では、 `index` のプロパティーはすべて 1 から始まります (0 ではなく)。

source: In the `quarkus` realm properties, navigate to `Identity Providers` and add a new SAML provider:
ja_jp: `quarkus` レルムのプロパティーで、 `Identity Providers` に移動し、新しい SAML プロバイダーを追加します。

source: In the `src/main/resource` directory, create a `lorem.txt` file with the following content:
ja_jp: `src/main/resource` ディレクトリに `lorem.txt` ファイルを次の内容で作成します。

source: In the `src/main/resources/application.properties` file, you need to configure the host, port, username, password as well as the other configuration aspect. Note that the password can also be configured using system properties and environment variables. See the xref:config-reference.adoc[configuration reference guide] for details.
ja_jp: Quarkus mailerはSMTPを使用しています。 `src/main/resources/application.properties` ファイルでは、ホスト、ポート、ユーザー名、パスワードだけでなく、他の設定面も設定する必要があります。パスワードは、システムのプロパティーや環境変数を使って設定することもできるのを覚えておいてください。詳しくはxref:config-reference.adoc[設定リファレンスガイド] を参照して下さい。

source: In the `src/main/resources/application.properties`, add:
ja_jp: `src/main/resources/application.properties` に以下を追加します:

source: In the `src/main/resources` directory, create a `lorem.txt` file with the following content:
ja_jp: `src/main/resources` ディレクトリに、以下の内容の `lorem.txt` ファイルを作成します:

source: In the above example, any code calling the `doSomething()` method triggers interception - in this case, the method becomes transactional. This is regardless of whether the invocation originated directly from the `MyService` bean (such as `MyService#doSomethingElse`) or from some other bean.
ja_jp: 上記の例では、 `doSomething()` メソッドを呼び出すすべてのコードがインターセプションをトリガーします。この場合、メソッドはトランザクションになります。 これは、呼び出しが `MyService` Bean (`MyService#doSomethingElse` など) から直接発生したか、他の Bean から発生したかには関係ありません。

source: In the above example, the type is `AgroalDataSource` which is a subtype of `javax.sql.DataSource`. Because of this, you can also use `javax.sql.DataSource` as the injected type.
ja_jp: 上記の例では、型は `AgroalDataSource` であり、 `javax.sql.DataSource` のサブタイプです。このため、 `javax.sql.DataSource` を注入された型として使用することもできます。

source: In the above example, the type is `AgroalDataSource`, a `javax.sql.DataSource` subtype. Because of this, you can also use `javax.sql.DataSource` as the injected type.
ja_jp: 上記の例では、型は `javax.sql.DataSource` のサブタイプである `AgroalDataSource` です。 このため、 `javax.sql.DataSource` を注入される型として使用することもできます。

source: In the above request, the query parameter names are mapped to corresponding properties in the input class.
ja_jp: 上記のリクエストでは、クエリパラメーター名が入力クラスの対応するプロパティーにマッピングされています。

source: In the analysis phase, a static points-to analysis starts from the main method of the program to find out what is reachable. As new classes are discovered, some of them will be initialized during this process depending on the configuration. In the next step, the heap is snapshotted and checks are made to see which types need to be available at runtime. The initialization and heap snapshotting can cause new types to be discovered, in which case the process is repeated. The process stops when a fixed point is reached, that is when the reachable program grows no more.
ja_jp: 解析フェーズでは、プログラムのメインメソッドから静的なPoint-to 解析を開始し、到達可能なものを見つけ出します。新しいクラスが発見されると、設定に応じてこのプロセス中にその一部が初期化されます。次のステップでは、ヒープがスナップショットされ、どのタイプが実行時に利用可能である必要があるかのチェックが行われます。初期化とヒープのスナップショットにより、新しい型が発見されることがありますが、その場合はこのプロセスが繰り返されます。このプロセスは、到達可能なプログラムがこれ以上成長しないという固定点に達したときに停止します。

source: In the application.properties file, add the following build time configuration.
ja_jp: application.properties ファイルに、以下のビルド時設定を追加します。
